app/controllers/tweets_controller.rb

SELECT "hashtags"."name" FROM "hashtags" INNER JOIN "tweet_tags" ON "hashtags"."id" = "tweet_tags"."hashtag_id" WHERE "tweet_tags"."tweet_id" = 501
---

    hashtags_names = params[:hashtags] || []
    hashtags_names.each do |name|
      tweet.hashtags << Hashtag.first_or_create(name: name)