app/controllers/tweets_controller.rb

SELECT "hashtags".* FROM "hashtags" WHERE "hashtags"."name" = 'occaecati' LIMIT 1
SELECT "tweets".* FROM "tweets" INNER JOIN "tweet_tags" ON "tweets"."id" = "tweet_tags"."tweet_id" WHERE "tweet_tags"."hashtag_id" = 33 ORDER BY created_at DESC LIMIT 50
---
  def search
    hashtag = Hashtag.where(name: params[:keyword]).first
    puts hashtag
    if hashtag
      render json: hashtag.tweets.ordered_json

INSERT INTO "tweets" ("avatar_url", "content", "created_at", "handle", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT "hashtags".* FROM "hashtags" WHERE "hashtags"."name" = 'yolo' LIMIT 1
INSERT INTO "hashtags" ("name") VALUES ($1) RETURNING "id"  [["name", "yolo"]]
SELECT "tweet_tags".* FROM "tweet_tags" WHERE "tweet_tags"."hashtag_id" = 47 AND "tweet_tags"."tweet_id" = 501 LIMIT 1
INSERT INTO "tweet_tags" ("hashtag_id", "tweet_id") VALUES ($1, $2) RETURNING "id"  [["hashtag_id", 47], ["tweet_id", 501]]
---
  def create
    tweet = Tweet.new(params[:tweet])
    tweet.content ||= Faker::Lorem.sentence
    tweet.username ||= Faker::Name.name
    tweet.handle ||= "@" + Faker::Internet.user_name
    tweet.avatar_url ||= Faker::Avatar.image(tweet.username)
    tweet.save

    hashtags_names = params[:hashtags] || ["yolo"]

    hashtags_names.each do |name|

      hashtag = Hashtag.where(name: name).first
      hashtag = Hashtag.create(name: name) if hashtag.nil?
      tweettag = TweetTag.where(hashtag_id: hashtag.id, tweet_id: tweet.id).first

      if tweettag.nil?
            tweettag = TweetTag.new
            tweettag.hashtag = hashtag
            tweettag.tweet = tweet
            tweettag.save!